app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "ethics"], ["room_number", 100], ["created_at", "2020-10-29 17:27:49.154709"], ["updated_at", "2020-10-29 17:27:49.154709"]]
---
    def create
        @class = SchoolClass.create(class_params)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def find_class
        @class = SchoolClass.find(params[:id])